jonfleming/watch-os/sdkconfig.defaults
# watch-os — shared defaults for both Waveshare AMOLED boards.
# Board-specific flash/console live in sdkconfig.waveshare_amoled_{1_8,2_06}.
# Console defaults to UART0 (2.06 USB-UART bridge). The 1.8 overlay switches
# this to USB-Serial-JTAG. Flash defaults to 16 MB; the 2.06 overlay upgrades
# to 32 MB QIO.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# Keep WiFi/LWIP in internal RAM. The recorder default
# (TRY_ALLOCATE_WIFI_LWIP=y + OOSEQ_MAX_PBUFS=0) lets TLS complete the
# handshake, then the HTTPS SDP answer never arrives (ESP_ERR_HTTP_EAGAIN).
# Match the working standalone assistant.
# CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP is not set
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# LWIP / WiFi — same as openai-realtime-embedded (needed for SDP answer)
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
# CONFIG_ESP_WIFI_STATIC_TX_BUFFER is not set
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_RX_BA_WIN=6

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

# Assistant needs this: NDEBUG turns BSP ESP_ERROR_CHECK into a no-op, and
# init_lvgl() then survives a failed touch probe instead of rebooting.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y

# Voice Assistant (libpeer / DTLS-SRTP / WiFi captive portal)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024

# Voice Recorder
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_LONG_FILENAMES=y
CONFIG_RECORDER_SAMPLE_RATE=16000
CONFIG_RECORDER_BITS_PER_SAMPLE=16
CONFIG_RECORDER_CHANNELS=1
CONFIG_BUTTON_A_GPIO=0
CONFIG_BUTTON_B_GPIO=-1
CONFIG_BUTTON_DEBOUNCE_MS=50
CONFIG_BUTTON_SHORT_PRESS_MS=50
CONFIG_BUTTON_LONG_PRESS_MS=1500

# BSP
CONFIG_BSP_I2C_NUM=1
CONFIG_BSP_I2S_NUM=1
CONFIG_BSP_SPIFFS_MOUNT_POINT="/spiffs"
CONFIG_BSP_SPIFFS_PARTITION_LABEL="storage"
CONFIG_BSP_SPIFFS_MAX_FILES=5
CONFIG_BSP_SD_MOUNT_POINT="/sdcard"
CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=100
CONFIG_BSP_LCD_RGB_BOUNCE_BUFFER_HEIGHT=20

# LVGL (union of both apps' fonts)
CONFIG_LVGL_PORT_TASK_STACK_SIZE=8192
CONFIG_LVGL_PORT_TASK_PRIORITY=5
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y

# Voice Assistant: disable watchdogs (libpeer + audio tasks can run long).
# CONFIG_ESP_INT_WDT is not set
# CONFIG_ESP_TASK_WDT_EN is not set

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_FREERTOS_HZ=1000
